#### Terraform Format and Style 🖌`failure`
#### production - Terraform Initialization ⚙️`success`
#### production - Terraform Validation 🤖Success! The configuration is valid.


#### production - Terraform Plan 📖`success`

<details><summary>production - Show Plan</summary>

```terraform
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-production/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-production/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[16]: Refreshing state... [id=terra-datarepo-production/cloudkms.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-production/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-production/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-production/logging.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-production/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-production/dns.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-production/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-production/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-production/compute.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-production/container.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-production/genomics.googleapis.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-production/global/networks/production-network]
module.core-infrastructure.google_service_account.node_pool: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_key_ring.db: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/keyRings/jade-db]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-production/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-production/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_project_iam_member.node_pool[1]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.metricWriter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[0]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.viewer/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[5]: Refreshing state... [id=terra-datarepo-production/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[2]: Refreshing state... [id=terra-datarepo-production/roles/logging.logWriter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[3]: Refreshing state... [id=terra-datarepo-production/roles/container.admin/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[4]: Refreshing state... [id=terra-datarepo-production/roles/compute.admin/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_crypto_key.db: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/keyRings/jade-db/cryptoKeys/jade]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/subnetworks/production-subnet]
module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access: Refreshing state... [id=terra-datarepo-production/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-production/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-2"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-2-cis-highmem]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/jade-production-ip]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=GU6X8it2Z8Y]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=MhNUqvJm2Mlbx-sJadLRSw]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=t7FkZ3VyrruPNDAijW0kww]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=g2vmw5_ZvyUrKPv8jKBRKQ]
module.datarepo-app.module.sql_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com/keys/680be21dd40e7a34e4a2841674c38381d96c921c]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-production/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-production/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-production/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-production/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-production/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[12]: Refreshing state... [id=terra-datarepo-production/roles/cloudprofiler.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-production/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-production/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[13]: Refreshing state... [id=terra-datarepo-production/roles/cloudtrace.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[0]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[1]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[3]: Refreshing state... [id=folders/815384374864/roles/owner/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[2]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.sql_workloadid.google_project_iam_member.service-account-role["roles/cloudsql.client"]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.client/serviceaccount:datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-production/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-production/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com/keys/aed1f2c6275c7ab93d19725cfd436428b60ec84b]
module.datarepo-app.module.sql_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-api-sa]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-production%2Fglobal%2Fnetworks%2Fproduction-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/test-runner-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-sql-db]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-production/notificationChannels/464975950067283356]
module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-production/notificationChannels/6446377545950012706]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-production/uptimeCheckConfigs/data-terra-bio]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-production/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/828731061248504616]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/17668203417845901091]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/12610221002304665649]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/9202628085327048402]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.core-infrastructure.google_project_iam_member.node_pool[3] must be replaced
+/- resource "google_project_iam_member" "node_pool" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/container.admin/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/container.admin" -> "roles/cloudkms.cryptoKeyEncrypterDecrypter" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.core-infrastructure.google_project_iam_member.node_pool[4] will be destroyed
  - resource "google_project_iam_member" "node_pool" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/compute.admin/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/compute.admin" -> null
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC3339" -> (known after apply)
      - version          = -1 -> null
        # (1 unchanged attribute hidden)
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        id           = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        name         = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "workbench_notification_channel" {
        id           = "projects/terra-datarepo-production/notificationChannels/6446377545950012706"
        name         = "projects/terra-datarepo-production/notificationChannels/6446377545950012706"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[0] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/bigquery.admin" -> "roles/cloudsql.editor" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[1] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/cloudsql.admin" -> "roles/datastore.user" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[2] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/datastore.user" -> "roles/errorreporting.writer" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[3] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/errorreporting.writer" -> "roles/logging.logWriter" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[4] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/logging.logWriter" -> "roles/servicemanagement.serviceController" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[5] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/monitoring.admin" -> "roles/stackdriver.accounts.viewer" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[6] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/servicemanagement.serviceController" -> "roles/storage.legacyBucketReader" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[7] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/stackdriver.accounts.viewer" -> "roles/storage.legacyObjectReader" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[8] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/storage.admin" -> "roles/pubsub.editor" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[9] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/pubsub.admin" -> "roles/cloudprofiler.agent" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[10] must be replaced
+/- resource "google_project_iam_member" "api_sa_role" {
      ~ etag    = "BwXSFz165jk=" -> (known after apply)
      ~ id      = "terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/container.admin" -> "roles/cloudtrace.agent" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[11] will be destroyed
  - resource "google_project_iam_member" "api_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/resourcemanager.projectIamAdmin" -> null
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[12] will be destroyed
  - resource "google_project_iam_member" "api_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/cloudprofiler.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/cloudprofiler.agent" -> null
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[13] will be destroyed
  - resource "google_project_iam_member" "api_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/cloudtrace.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/cloudtrace.agent" -> null
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[0] will be destroyed
  - resource "google_project_iam_member" "test_runner_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/container.admin" -> null
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[1] will be destroyed
  - resource "google_project_iam_member" "test_runner_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/logging.viewer" -> null
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[2] will be destroyed
  - resource "google_project_iam_member" "test_runner_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/monitoring.viewer" -> null
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[3] will be destroyed
  - resource "google_project_iam_member" "test_runner_sa_role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/secretmanager.admin" -> null
    }

  # module.datarepo-app.google_service_account.datarepo_test_runner_sa[0] will be destroyed
  - resource "google_service_account" "datarepo_test_runner_sa" {
      - account_id   = "datarepo-jade-test-runner" -> null
      - display_name = "datarepo-jade-test-runner" -> null
      - email        = "datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - id           = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - name         = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project      = "terra-datarepo-production" -> null
      - unique_id    = "105139269079464375630" -> null
    }

  # module.datarepo-app.google_service_account_key.test_runner_sa_key[0] will be destroyed
  - resource "google_service_account_key" "test_runner_sa_key" {
      - id                 = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com/keys/aed1f2c6275c7ab93d19725cfd436428b60ec84b" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com/keys/aed1f2c6275c7ab93d19725cfd436428b60ec84b" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZFd5ZHZxN0dtUUl3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTFNVE01TWpZNU1EYzVORFkwTXpjMU5qTXdNQ0FYRFRJd01UQXhOREUyTXpZMU5Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EVXhNemt5Tmprd056azBOalF6TnpVMk16QXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRREthbTl4elZFRHM1bW1WMTZINlQ0L0MvSXQKS3hoR1h3akxWN3JLK21NQTluWHBBNGlrelZ0R2ZUbDNubmE0VnpVTDRzdm9mUkNrclF1VGJNOTJyVEg5M01MawpFVUp3S3Rld0lsRy9WKzJnNGg2dHRSUXZjUW5VYmtuaGZnMkxMQ3dIN3JtMUExUjNvRHkwSGg2YytVSEFrTHg3ClVMQmE4R2J6c0hRQzVOVE54bVloa1BLcVlxb3hNcnV2YlJKVDVQbFRNZktVdWcyTlg3eVY2ZjFFMTNCWnJsYjcKWHJEblk1cVRXT1hTQnk2ano4RkVzZHRzNDQ0MUZYMU9rbkFlMTRtVngzTzFKSGFiYVI4bDN3cFBUMmFPdllFMwpoamQyOHRKNjVoQUtvTFpldE9XKzN4RXhvWkRMTVplZkZPd0wxWW9mc0x6TkI1Wmpkb0E3OXhjSURNWHpBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQURkc0Q1Wk5uNE5kWG8xU2FhMXVCcApkV25ocWpNTDlLY1Bic1loekJ3SStXSS9RMUJtaEMramhwa3Q0S3h3UnZHU0V6V21HdFVDR0JQeHhpMlh0dTNGCmJZSkxDWEY4ZFp4Qm1NQTBNZUdZNVhWcjRoN1luaFF2WlVyR3JmS2FBQm5YeXhSdzc5N0hHbFdjbW9jdWIzTnUKZmRCcEJjSFkvd01heUFwdE4xY0V6QUd1ZFVlMTVkUlU5UGsvTS9LV2puWThkekZKRzZ1MmNkSUpHUjZvMm1RSAorSUxpNkxtcUx1cnl2VEVuZlIwOW9lM1pHN29RV0l3NVNnYVpqb2g0akpvbDBXVEZrNjdzdEoxb29TREVkd3A5CkR5UmZPQWxzN1FJalJPamhPa2c2ZHJMeTFnWm95TEw3RzFNNUdkNjBKU01sSjh0VXhLazNhNC9vOENjbUZDUUwKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-10-14T16:36:55Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # module.datarepo-app.vault_generic_secret.test_runner_sa_key[0] will be destroyed
  - resource "vault_generic_secret" "test_runner_sa_key" {
      - data         = (sensitive value)
      - data_json    = (sensitive value)
      - disable_read = false -> null
      - id           = "secret/dsde/datarepo/production/test-runner-sa" -> null
      - path         = "secret/dsde/datarepo/production/test-runner-sa" -> null
    }

  # module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"] will be destroyed
  - resource "google_project_iam_member" "service-account-role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/logging.admin" -> null
    }

  # module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"] will be destroyed
  - resource "google_project_iam_member" "service-account-role" {
      - etag    = "BwXSFz165jk=" -> null
      - id      = "terra-datarepo-production/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com" -> null
      - project = "terra-datarepo-production" -> null
      - role    = "roles/monitoring.admin" -> null
    }

Plan: 12 to add, 2 to change, 25 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @nmalfroy, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*